[{"note":"###Enable JNotes++###\n<!DOCTYPE html>\n<html>\n<body>\n    <h1>HTML-File Example<\/h1>\n    <p><font color = 'red'> This<\/font> is an example for JNotes++<\/p>\n<\/body>\n<\/html>\n","title":"HTML-File","timestamp":"21.06.2023-21:35:34"},{"note":"Welcome to JNotes V.0.1!\n\nWhen working with JSON, it's important to be aware of the characters that are safe to use within a JSON string. \nAny characters outside of this set may cause errors or require special handling.\n\n+------------------------------------------------------------------------------------------------------------+\n | Safe characters to use in a JSON string:\t\t\t|\n |\t\t\t\t\t|\n | Digits: 0 1 2 3 4 5 6 7 8 9\t\t\t\t|\n | Lowercase letters: a b c d e f g h i j k l m n o p q r s t u v w x y z\t\t|\n | Uppercase letters: A B C D E F G H I J K L M N O P Q R S T U V W X Y Z\t|\n | Special characters: < > , ; . : - _ # ' + * ~ ' ` ! \" $ % & \/ ( ) = ? ^ @ € | { [ ] } \\\t|\n+------------------------------------------------------------------------------------------------------------+\n\nPlease note that any characters not included in the above list will be replaced by \"?%uc!\". \nAdditionally, line breaks, blank spaces, and tab spaces are not explicitly listed but are considered safe for use..\n\n---ALPHA Features---\n\nIn addition to the safe character set, JNotes V.0.1 also introduces some additional features for working with formatted file previews. \n\n------Formated-Filepreview------\nBy including the text '###Enable JNotes++###' on the first line of a document, you can enable formatted file previews using HTML code. \nPlease be cautious, as there will be no height restriction for this element, though the width will remain locked.\n------------\n\n------Force-Break-Preview------\nIf you want to cut the preview of en element, just put \"<\" followed by your text or any letter without whitespaces.\n\n--Example--\n\nPreviewbreak <here\nThis will not be shown in the preview\n\n----\nwould stop the preview after the word 'Previewbreak'\n------","title":"ALPHA V0.1","timestamp":"21.06.2023-21:35:34"}]